{
	"title": "Data",
	"paragraphs": [
		{
			"text": "We downloaded our data from a Kaggle <a href='https://www.kaggle.com/c/asap-aes/data'>competition</a> hosted by The Hewlett Foundation. We use this section to describe the structure of the data (i.e. the data dictionary), and we perform preliminary exploration of this data in the next section (see <a href='#exploration'>Data Exploration</a> below)."
		},
		{
			"text": "The data is comprised of 5 main columns (there are a handful of other columns as well, but they are only partially complete and are less important than the ones listed here): <span class='bold'>essay_set, essay, rater1_domain1, rater2_domain1, and domain1_score</span>." 
		},
		{
			"text": "<ul class='column-list'><li>The <span class='bold'>essay_set</span> column contains a number between 1 and 8 which indicates the prompt for the given essay — because we know that essay sets don't necessarilly have the same grading rubric, it seems clear that this column will be valuable as a feature in our model.</li><li>The <span class='bold'>essay</span> column contains the raw essay text, which, as mentioned in the previous section, has been cleaned of personal identifying information. Immediately, we know that this column can't be used as a model feature without some sort of preprocessing. In the sections below, we describe our preprocessing method, known as tf-idf vectorization.</li><li>The <span class='bold'>rater1_domain1</span> and <span class='bold'>rater2_domain1</span> columns represent grades for the given essay by two independent expert raters, both human. It is common practice to involve two independent human graders in the task of grading essays from standardized tests, as a means of reducing bias and error. The <span class='bold'>domain1_score</span> consolidates the scores from both judges by adding the two. We treat this composite number as our response variable.</li></ul>",
			"image": "../../graphs/essay_df_sample.png",
			"width": "900px"
		}
	]
}
